Revit 2017 API
BentFabricWiresOrientation Enumeration
 Bent Fabric wires orientation.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2016
Since: 2016
Syntax
C#
[ObsoleteAttribute("This enum is obsolete in Revit 2017. Use BentFabricStraightWiresLocation instead.")]
public enum BentFabricWiresOrientation
Visual Basic
<ObsoleteAttribute("This enum is obsolete in Revit 2017. Use BentFabricStraightWiresLocation instead.")> _
Public Enumeration BentFabricWiresOrientation
Visual C++
[ObsoleteAttribute(L"This enum is obsolete in Revit 2017. Use BentFabricStraightWiresLocation instead.")]
public enum class BentFabricWiresOrientation
Members
Member name | Description
Down |  Fabric minor wires are below major wires.
Up |  Fabric minor wires are above major wires.
See Also
Autodesk.Revit.DB.Structure Namespace